Repository: Bowsapy/Trener2
Catalog: Trener2-main/Trener/Resources/Languages/objectsStrings.*.resx
Languages: cs

# AboutAppButton
source: STRIKES
cs: INFO

# AddCButton
source: Add combo
cs: Přidej kombo

# add_countersText
source: Add counters
cs: Přidej kontry

# AllButton
source: All
cs: Vše

source: Amateur
cs: Amatér

# BackButton
source: Back
cs: Zpět

# BasicDefenceButton
source: Basic defence
cs: Základní obrana

# BasicMovementButton
source: Basic movement
cs: Základní pohyb

# BasicStrikesButton
source: Basic strikes
cs: Základní údery

# basic_strikes_introText
source: Only single punches
cs: Jenom jednotlivý údery

# BBDesc
source: BB - Body Block: Blocking straight punches to the body by keeping elbows together.
cs: BB - Bodyblock: Blokování přímých úderů na tělo udržením loktů u sebe.

# BCrossButton
source: Body cross
cs: Zadní direkt tělo

# BJabButton
source: Body jab
cs: Přední direkt tělo

# BodyCrossDesc
source: 2b - Body Cross: A cross aimed at the opponent’s body.
cs: 2b - Zadní direkt tělo: Zadní direkt do těla

# BodyJabDesc
source: 1b - Body Jab: A jab aimed at the opponent’s body.
cs: 1b - Přední direkt tělo: Přední direkt zaměřený na tělo protivníka.

source: Burpees
cs: Angličáky

# Champ
source: Champion
cs: Šampion

source: Close fighting
cs: Box na blízko

# CMButton
source: Combos with movement
cs: Kombinace s pohybem

# combos_after_moves
source: Combos after movement
cs: Kombinace po pohybu

# completion
source: You've completed your workout!
cs: Dokončil jsi workout!

# CounterpuncherIntro
source: Lean forward and drop your hands a little
cs: Předklon a dej si ruce trochu dolu

# counterpuncherintroText
source: Lean forward and drop your hands a little
cs: Předklon a dej si ruce trochu dolu

# countersonly
source: Only counters
cs: Jen kontry

# countText
source: Count
cs: Počet

# CrossButton
source: Cross
cs: Zadní direkt

# CrossDesc
source: 2 - Cross: A powerful straight punch thrown with the rear hand.
cs: 2 - Zadní direkt: Silný, přímý úder provedený zadní rukou.

# DDesc
source: Duck: Squatting to avoid straight punches.
cs: Dřep: Podřepnutí pro vyhnutí se přímým úderům.

# DefenceButton
source: Defence
cs: Obrana

# defence_onlyText
source: Only defence
cs: Jen obrana

# DelButton
source: Delete combo
cs: Smazat kombo

# DelCurButton
source: Delete this workout
cs: Smazat tenhle workout

# DuckButton
source: Duck
cs: Dřep

# emptyWorkoutError
source: The workout is empty, add at least 1 combo
cs: Workout je prázdný, přidej alespoň jednu kombinaci.

# endText
source: End
cs: Konec

# exerciseText
source: Exercise
cs: Cvik

# finishwithBodyshot
source: Finish combo with bodyshot
cs: Zakonči kombo spodkem

# FreestyleButton
source: FREESTYLE WORKOUTS
cs: FREESTYLE WORKOUTY

source: Good job!
cs: Dobrá práce!

# hands_high
source: High guard
cs: Dvoják

# headmovementandcounter
source: Dodge and counter
cs: Vyhni se a zakontruj

# headmovement_only
source: Only headmovement
cs: Jen headmovement

# ISButton
source: Inside sidestep
cs: Vnitřní sidestep

# JabButton
source: Jab
cs: Přední direkt

# JabDesc
source: 1 - Jab: A quick, straight punch with the lead hand, the most commonly used punch in boxing.
cs: 1 - Přední direkt: Rychlý, přímý úder přední rukou, nejčastěji používaný úder v boxu.

source: Keep moving
cs: Pořád se hýbej

source: Keep moving forward
cs: Pořád se hýbej dopředu

# LBBButton
source: Lead bodyblock
cs: Přední bodyblock

# LBBDesc
source: LBB - Lead Body Block: Blocking a body hook by tilting toward the lead side.
cs: LBB - Přední bodyblock: Blokování tělesného háku nakloněním těla směrem k přední noze.

# LBDesc
source: LB - Lead Block: Blocking a straight punch with the lead hand
cs: LBlock - Přední blok: Blokování přímého úderu přední rukou.

# LBHook
source: Lead hook body
cs: Přední hák tělo

# LBUpperButton
source: Lead body uppercut
cs: Přední zvedák tělo

# LCButton
source: Lead catch
cs: Přední catch

# LCDesc
source: LC - Lead Catch: Blocking a hook with the lead hand.
cs: LCatch - Přední catch: Blokování háku přední rukou.

# LCombosButton
source: Longer combos
cs: Delší kombinace

# LeadBodyHookDesc
source: 3b - Lead Body Hook: A lead hook aimed at the opponent’s body.
cs: 3b- Přední hák tělo: Přední hák zaměřený na tělo protivníka.

# LeadHookDesc
source: 3 - Lead Hook: A hooking punch thrown with the lead hand.
cs: 3 - Přední hák: Hák provedený přední rukou.

# LeadUpperDesc
source: 5 - Lead Uppercut: A rising punch thrown with the lead hand, useful for close-range attacks.
cs: 5 - Přední zvedák: zvedák přední rukou, užitečný pro útoky na krátkou vzdálenost.

# LeadUppperBodyDesc
source: 5b - Lead Body Uppercut: A lead uppercut targeting the opponent’s body.
cs: 5b - Přední zvedák tělo: Přední zvedák zaměřený na tělo protivníka.

# LearnTechButton
source: LEARN TECHNIQUE
cs: NAUČ SE TECHNIKU

# LHookButton
source: Lead hook
cs: Přední hák

# LongRangeButton
source: Long range fighter
cs: Box na dlouhou vzdálenost

# longrangefighterintro
source: Control distance with your lead hand
cs: Kontroluj vzdálenost přední rukou

# LPButton
source: Lead parry
cs: Přední sražení

# LRButton
source: Lead roll
cs: Přední roll

# LRDesc
source: LR - Lead Roll: Avoiding a hook by rolling toward the lead foot.
cs: LRoll - Přední roll: Vyhnutí se háku pohybem hlavy směrem k přední noze.

# LSDesc
source: LS - Lead Slip: Dodging a straight punch by moving toward the lead foot.
cs: LSlip - Přední slip: Vyhnutí se přímému úderu pohybem směrem k přední noze.

# LSlipButton
source: Lead slip
cs: Přední slip

# LUpperButton
source: Lead uppercut
cs: Přední zvedák

source: Mix it up
cs: Vše dohromady

# moveandjab
source: Move around and jab
cs: Hýbej se a používej přední direkt

source: Movement
cs: Pohyb

# MovementButton
source: Movement
cs: Pohyb

source: Move your head
cs: Hýbej hlavou

# move_only
source: Only movement
cs: Jen pohyb

# MYOWorkoutButton
source: OWN WORKOUTS
cs: VYTVOŘ SI WORKOUT

# nameMessage
source: Enter name!
cs: Zadej název!

source: Name of workout
cs: Jméno workoutu

source: Next round
cs: Další kolo

# onlyhooksandupper
source: Only hooks and uppercuts
cs: Jen háky a zvedáky

source: Only straight punches
cs: Jen přímý údery

# OSButton
source: Outside sidestep
cs: Vnější sidestep

source: Outside sidestep
cs: Vnější sidestep

# pauseText
source: Pause
cs: Pauza

source: Plank
cs: Prkno

# pressureFighterIntro
source: Pressure
cs: Tlak

# pro
source: Professional
cs: Profesionál

# ProgressButton
source: PROGRESS
cs: POKROK

# PunchesButton
source: Punches
cs: Údery

source: Pushups
cs: Kliky

# QuitButton
source: QUIT
cs: KONEC

# RBBButton
source: Rear Bodyblock
cs: Zadní bodyblock

# RBBDesc
source: RBB - Rear Bodyblock: Blocking a body hook by tilting toward the rear side.
cs: RBB - Zadní bodyblock: Blokování tělesného háku nakloněním těla směrem k zadní straně.

# RBDesc
source: LB - Lead Block: Blocking a straight punch with the rear hand
cs: RB - Zadní blok: Blokování přímého úderu zadní rukou.

# RBHookButton
source: Rear body hook
cs: Zadní hák tělo

# RBUpperButton
source: Rear body uppercut
cs: Zadní zvedák tělo

# RCButton
source: Rear catch
cs: Zadní catch

# RCDesc
source: RC - Rear Catch: Blocking a hook with the rear hand.
cs: RCatch - Zadní catch: Blokování háku zadní rukou.

# RearHookBodyDesc
source: 4b - Rear Body Hook: A rear hook aimed at the opponent’s body.
cs: 4b - Zadní hák tělo: Zadní hák zaměřený na tělo protivníka.

# RearHookDesc
source: 4 - Rear Hook: A hooking punch thrown with the rear hand for more power.
cs: 4 - Zadní hák: Silný hák zadní rukou

# RearUpperBodyDesc
source: 6b - Rear Body Uppercut: A rear uppercut targeting the opponent’s body.
cs: 6b - Zadní zvedák tělo: Zadní zvedák zaměřený na tělo protivníka.

# RearUpperDesc
source: 6 - Rear Uppercut: A powerful uppercut thrown with the rear hand.
cs: 6 - Zadní zvedák: Silný zvedák zadní rukou.

# repText
source: Rep
cs: Opak.

# SBDesc
source: SB - Step Backwards: Moving backwards by stepping with the rear foot first, followed by the lead foot.
cs: StepB - Úkrok vzad: Pohyb vzad krokem zadní nohou, následovaný krokem přední nohou

# RHookButton
source: Rear hook
cs: Zadní hák

# RPButton
source: Rear parry
cs: Zadní sražení

# RRButton
source: Rear roll
cs: Zadní roll

# RRDesc
source: RR - Rear Roll: Avoiding a hook by rolling toward the rear foot.
cs: RRoll - Zadní roll: Vyhnutí se háku pohybem hlavy směrem k zadní noze.

# RSDesc
source: RS - Rear Slip: Dodging a straight punch by moving toward the rear foot.
cs: RSlip - Zadní slip: Vyhnutí se přímému úderu pohybem směrem k zadní noze.

# RSlipButton
source: Rear slip
cs: Zadní slip

# RUpperButton
source: Rear uppercut
cs: Zadní zvedák

# SaveButton
source: Save workout
cs: Uložit workout

source: Select a workout
cs: Vyber si workout

# semi_pro
source: Semi-professional
cs: Poloprofesionál

# SFDesc
source: SF - Step Forward: Moving forward by stepping with the lead foot first, followed by the rear foot."
cs: StepF - Úkrok dopředu: Pohyb vpřed krokem s přední nohou, následovaný krokem zadní nohy.

source: Shadow boxing
cs: Stínový box

# ShadowboxingButton
source: Shadowboxing circuit
cs: Stínování kruháč

# ShowButton
source: Show workout
cs: Zobrazit workout

source: Situps
cs: Lehsedy

source: Skipping rope
cs: Švihadlo

# SkippingRopeButton
source: Skipping rope circuit
cs: Švihadlo kruháč

# skipText
source: Skip
cs: Přeskoč

source: Speed
cs: Rychlost

# speedMessage
source: Enter speed!
cs: Zadej rychlost!

source: Squats
cs: Dřepy

# startwithjab
source: Start every combo with jab
cs: Začínej předním direktem

# StBButton
source: Step back
cs: Úkrok dozadu

# StFButton
source: Step forward
cs: Úkrok dopředu

# StLButton
source: Step left
cs: Úkrok doleva

# StRButton
source: Step right
cs: Úkrok doprava

# StylesButton
source: STYLES
cs: STYLY

# SwitchHitterButton
source: Switchhitting
cs: Prohazovač postrojů

# SwitchLangButton
source: Change language
cs: Změnit jazyk

source: Switch stance
cs: Změň postoj

# Tech1Button
source: TECHNIQUE 1
cs: TECHNIKA 1

# Tech2Button
source: TECHNIQUE 2
cs: TECHNIKA 2

# three_p_combosText
source: Three punch combos
cs: Tříúderové kombinace

# three_p_combos_defenceText
source: Three punch combos with defence
cs: Tříúderové kombinace s obranou

# three_p_combos_movementText
source: Three punch combos with movement
cs: Tříúderové kombinace s pohybem

# timeText
source: Time
cs: Čas

source: Two punch combos only
cs: Jenom dvouúderové kombinace

# two_p_combosText
source: Two punch combos
cs: Dvouúderové kombinace

# useonlyleadhand
source: Use your lead hand only
cs: Používej jen přední ruku

# ViewButton
source: View your own workouts
cs: Zobrazit vlastní workouty

# SRDesc
source: SR - Step Right: Moving right by stepping with right foot first, followed by the left foot.
cs: StepR - Úkrok doprava : Pohyb doprava krokem pravou nohou, následovaný krokem levou nohy

# SLDesc
source: SL - Step Left: Moving left by stepping with left foot first, followed by the right foot.
cs: StepL - Úkrok doleva: Pohyb doleva krokem levou nohou, následovaný krokem pravé nohy

# ISDesc
source: ISS - Inside Sidestep: Avoiding a straight punch by stepping with the lead foot toward the rear side and pivoting.
cs: ISStep - Vnitřní sidestep: Vyhnutí se přímému úderu krokem přední nohou směrem k zadní straně a následným pivotem.

# OSDesc
source: OSS - Outside Sidestep: Avoiding a straight punch by stepping with the lead foot further to the lead side and pivoting.
cs: OSStep - Vnější sidestep: Vyhnutí se přímému úderu krokem přední nohou směrem k přední straně a následným pivotem.

# StanceDesc
source: Stance
cs: Postoj

# OrthodoxDesc
source: For Orthodox (Right-Handed Boxer): Lead - Left, Rear - Right
cs: Pro orthodoxního boxera (pravák): Přední - Levá, Zadní - Pravá.

# SouthpawDesc
source: For Southpaw (Left-Handed Boxer): Lead - Right, Rear - Left
cs: Pro southpaw boxera (levák): Přední - Pravá, Zadní - Levá.
